notes/20260219202355-alex_honnold_podcst_notes.org
:PROPERTIES:
:ID:       337dfe0c-b449-45f3-b405-f45f7232260c
:END:
#+title: alex honnold podcast notes
* <2026-02-19 Thu>
* like to be on top, like air, 
* like the views
* his mother could speak 8 langugages and multiple musical instruments.
* amygdala fires up lesser for him than general people.
* was very shy pulic speaing, nervous earlier
* now very good
* whats your hack to overcome fear?
#+begin_quote
you becomee scared so many times over and over and eventually its not that scary anymore
#+end_quote
* if you go through that porocess then you arent really afraid.
* in climbing the fear builds up in each step.
* while in other sports its short time - you jump then its done. paragliding jumping etc.
* 
