20260219202355-alex_honnold_podcst_notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-03-11 Wed 03:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>alex honnold podcast notes</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">alex honnold podcast notes</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga3b9d02"><span class="timestamp-wrapper"><span class="timestamp">&lt;2026-02-19 Thu&gt;</span></span></a></li>
<li><a href="#orgfcaee0c">like to be on top, like air,</a></li>
<li><a href="#org753835b">like the views</a></li>
<li><a href="#orgdba85c8">his mother could speak 8 langugages and multiple musical instruments.</a></li>
<li><a href="#org72d2e7c">amygdala fires up lesser for him than general people.</a></li>
<li><a href="#orgc188fe8">was very shy pulic speaing, nervous earlier</a></li>
<li><a href="#orgdf9e36a">now very good</a></li>
<li><a href="#orga5df910">whats your hack to overcome fear?</a></li>
<li><a href="#orgbd12a80">if you go through that porocess then you arent really afraid.</a></li>
<li><a href="#orgf924de8">in climbing the fear builds up in each step.</a></li>
<li><a href="#org5e7f8a6">while in other sports its short time - you jump then its done. paragliding jumping etc.</a></li>
<li><a href="#org16d5140"></a></li>
</ul>
</div>
</div>
<div id="outline-container-orga3b9d02" class="outline-2">
<h2 id="orga3b9d02"><span class="timestamp-wrapper"><span class="timestamp">&lt;2026-02-19 Thu&gt;</span></span></h2>
</div>
<div id="outline-container-orgfcaee0c" class="outline-2">
<h2 id="orgfcaee0c">like to be on top, like air,</h2>
</div>
<div id="outline-container-org753835b" class="outline-2">
<h2 id="org753835b">like the views</h2>
</div>
<div id="outline-container-orgdba85c8" class="outline-2">
<h2 id="orgdba85c8">his mother could speak 8 langugages and multiple musical instruments.</h2>
</div>
<div id="outline-container-org72d2e7c" class="outline-2">
<h2 id="org72d2e7c">amygdala fires up lesser for him than general people.</h2>
</div>
<div id="outline-container-orgc188fe8" class="outline-2">
<h2 id="orgc188fe8">was very shy pulic speaing, nervous earlier</h2>
</div>
<div id="outline-container-orgdf9e36a" class="outline-2">
<h2 id="orgdf9e36a">now very good</h2>
</div>
<div id="outline-container-orga5df910" class="outline-2">
<h2 id="orga5df910">whats your hack to overcome fear?</h2>
<div class="outline-text-2" id="text-orga5df910">
<blockquote>
<p>
you becomee scared so many times over and over and eventually its not that scary anymore
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgbd12a80" class="outline-2">
<h2 id="orgbd12a80">if you go through that porocess then you arent really afraid.</h2>
</div>
<div id="outline-container-orgf924de8" class="outline-2">
<h2 id="orgf924de8">in climbing the fear builds up in each step.</h2>
</div>
<div id="outline-container-org5e7f8a6" class="outline-2">
<h2 id="org5e7f8a6">while in other sports its short time - you jump then its done. paragliding jumping etc.</h2>
</div>
<div id="outline-container-org16d5140" class="outline-2">
<h2 id="org16d5140"></h2>
</div>
</div>
</body>
</html>